import React from "react";
import '../../App.css'
export default function QuranKarim() {
  return (
    <div className="pt-12 text-center w-full amiri-quran-regular">
      <h1 className="text-yellow-400 ">
        بِسْمِ اللّٰهِ الرَّحْمٰنِ الرَّحِیْمِ
      </h1>
      <div className="text-end text-black ">
       <p className=" 	pr-4 ">
       الٓمّٓ(1) ذٰلِكَ الْكِتٰبُ لَا رَیْبَ  فِیْهِ ۚۛ-هُدًى لِّلْمُتَّقِیْنَ(2) الَّذِیْنَ یُؤْمِنُوْنَ بِالْغَیْبِ وَ یُقِیْمُوْنَ الصَّلٰوةَ وَ مِمَّا رَزَقْنٰهُمْ یُنْفِقُوْنَ(3) وَ الَّذِیْنَ یُؤْمِنُوْنَ بِمَاۤ اُنْزِلَ اِلَیْكَ وَ مَاۤ اُنْزِلَ مِنْ قَبْلِكَۚ-وَ بِالْاٰخِرَةِ هُمْ یُوْقِنُوْنَﭤ(4) اُولٰٓىٕكَ عَلٰى هُدًى مِّنْ رَّبِّهِمْۗ-وَ اُولٰٓىٕكَ هُمُ الْمُفْلِحُوْنَ(5) اِنَّ الَّذِیْنَ كَفَرُوْا سَوَآءٌ عَلَیْهِمْ ءَاَنْذَرْتَهُمْ اَمْ لَمْ تُنْذِرْهُمْ لَا یُؤْمِنُوْنَ(6) خَتَمَ اللّٰهُ عَلٰى قُلُوْبِهِمْ وَ عَلٰى سَمْعِهِمْؕ-وَ عَلٰۤى اَبْصَارِهِمْ غِشَاوَةٌ٘-وَّ لَهُمْ عَذَابٌ عَظِیْمٌ(7)
       </p>
        {/* <div className="border-b-2 border-gray-600 border-dashed"></div> */}
      </div>
    </div>
  );
}

// <p className=" pr-8 ">الٓمٓ ١</p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>

// <p className=" pr-8 ">
//   ذَٰلِكَ ٱلْكِتَـٰبُ لَا رَيْبَ ۛ فِيهِ ۛ هُدًۭى لِّلْمُتَّقِينَ ٢
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   ٱلَّذِينَ يُؤْمِنُونَ بِٱلْغَيْبِ وَيُقِيمُونَ ٱلصَّلَوٰةَ وَمِمَّا
//   رَزَقْنَـٰهُمْ يُنفِقُونَ ٣
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   وَٱلَّذِينَ يُؤْمِنُونَ بِمَآ أُنزِلَ إِلَيْكَ وَمَآ أُنزِلَ مِن
//   قَبْلِكَ وَبِٱلْـَٔاخِرَةِ هُمْ يُوقِنُونَ ٤
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   أُو۟لَـٰٓئِكَ عَلَىٰ هُدًۭى مِّن رَّبِّهِمْ ۖ وَأُو۟لَـٰٓئِكَ هُمُ
//   ٱلْمُفْلِحُونَ ٥
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   إِنَّ ٱلَّذِينَ كَفَرُوا۟ سَوَآءٌ عَلَيْهِمْ ءَأَنذَرْتَهُمْ أَمْ
//   لَمْ تُنذِرْهُمْ لَا يُؤْمِنُونَ ٦
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   خَتَمَ ٱللَّهُ عَلَىٰ قُلُوبِهِمْ وَعَلَىٰ سَمْعِهِمْ ۖ وَعَلَىٰٓ
//   أَبْصَـٰرِهِمْ غِشَـٰوَةٌۭ ۖ وَلَهُمْ عَذَابٌ عَظِيمٌۭ ٧
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   وَمِنَ ٱلنَّاسِ مَن يَقُولُ ءَامَنَّا بِٱللَّهِ وَبِٱلْيَوْمِ
//   ٱلْـَٔاخِرِ وَمَا هُم بِمُؤْمِنِينَ ٨
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   يُخَـٰدِعُونَ ٱللَّهَ وَٱلَّذِينَ ءَامَنُوا۟ وَمَا يَخْدَعُونَ إِلَّآ
//   أَنفُسَهُمْ وَمَا يَشْعُرُونَ ٩
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   فِى قُلُوبِهِم مَّرَضٌۭ فَزَادَهُمُ ٱللَّهُ مَرَضًۭا ۖ وَلَهُمْ
//   عَذَابٌ أَلِيمٌۢ بِمَا كَانُوا۟ يَكْذِبُونَ ١٠
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   وَإِذَا قِيلَ لَهُمْ لَا تُفْسِدُوا۟ فِى ٱلْأَرْضِ قَالُوٓا۟ إِنَّمَا
//   نَحْنُ مُصْلِحُونَ ١١
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   أَلَآ إِنَّهُمْ هُمُ ٱلْمُفْسِدُونَ وَلَـٰكِن لَّا يَشْعُرُونَ ١٢
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   وَإِذَا قِيلَ لَهُمْ ءَامِنُوا۟ كَمَآ ءَامَنَ ٱلنَّاسُ قَالُوٓا۟
//   أَنُؤْمِنُ كَمَآ ءَامَنَ ٱلسُّفَهَآءُ ۗ أَلَآ إِنَّهُمْ هُمُ
//   ٱلسُّفَهَآءُ وَلَـٰكِن لَّا يَعْلَمُونَ ١٣
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   وَإِذَا لَقُوا۟ ٱلَّذِينَ ءَامَنُوا۟ قَالُوٓا۟ ءَامَنَّا وَإِذَا
//   خَلَوْا۟ إِلَىٰ شَيَـٰطِينِهِمْ قَالُوٓا۟ إِنَّا مَعَكُمْ إِنَّمَا
//   نَحْنُ مُسْتَهْزِءُونَ ١٤
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   ٱللَّهُ يَسْتَهْزِئُ بِهِمْ وَيَمُدُّهُمْ فِى طُغْيَـٰنِهِمْ
//   يَعْمَهُونَ ١٥
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   أُو۟لَـٰٓئِكَ ٱلَّذِينَ ٱشْتَرَوُا۟ ٱلضَّلَـٰلَةَ بِٱلْهُدَىٰ فَمَا
//   رَبِحَت تِّجَـٰرَتُهُمْ وَمَا كَانُوا۟ مُهْتَدِينَ ١٦
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   مَثَلُهُمْ كَمَثَلِ ٱلَّذِى ٱسْتَوْقَدَ نَارًۭا فَلَمَّآ أَضَآءَتْ
//   مَا حَوْلَهُۥ ذَهَبَ ٱللَّهُ بِنُورِهِمْ وَتَرَكَهُمْ فِى ظُلُمَـٰتٍۢ
//   لَّا يُبْصِرُونَ ١٧
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   صُمٌّۢ بُكْمٌ عُمْىٌۭ فَهُمْ لَا يَرْجِعُونَ ١٨
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   أَوْ كَصَيِّبٍۢ مِّنَ ٱلسَّمَآءِ فِيهِ ظُلُمَـٰتٌۭ وَرَعْدٌۭ
//   وَبَرْقٌۭ يَجْعَلُونَ أَصَـٰبِعَهُمْ فِىٓ ءَاذَانِهِم مِّنَ
//   ٱلصَّوَٰعِقِ حَذَرَ ٱلْمَوْتِ ۚ وَٱللَّهُ مُحِيطٌۢ بِٱلْكَـٰفِرِينَ ١٩
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   يَكَادُ ٱلْبَرْقُ يَخْطَفُ أَبْصَـٰرَهُمْ ۖ كُلَّمَآ أَضَآءَ لَهُم
//   مَّشَوْا۟ فِيهِ وَإِذَآ أَظْلَمَ عَلَيْهِمْ قَامُوا۟ ۚ وَلَوْ شَآءَ
//   ٱللَّهُ لَذَهَبَ بِسَمْعِهِمْ وَأَبْصَـٰرِهِمْ ۚ إِنَّ ٱللَّهَ عَلَىٰ
//   كُلِّ شَىْءٍۢ قَدِيرٌۭ ٢٠
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   يَكَادُ ٱلْبَرْقُ يَخْطَفُ أَبْصَـٰرَهُمْ ۖ كُلَّمَآ أَضَآءَ لَهُم
//   مَّشَوْا۟ فِيهِ وَإِذَآ أَظْلَمَ عَلَيْهِمْ قَامُوا۟ ۚ وَلَوْ شَآءَ
//   ٱللَّهُ لَذَهَبَ بِسَمْعِهِمْ وَأَبْصَـٰرِهِمْ ۚ إِنَّ ٱللَّهَ عَلَىٰ
//   كُلِّ شَىْءٍۢ قَدِيرٌۭ ٢٠
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   يَـٰٓأَيُّهَا ٱلنَّاسُ ٱعْبُدُوا۟ رَبَّكُمُ ٱلَّذِى خَلَقَكُمْ
//   وَٱلَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ ٢١
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   ٱلَّذِى جَعَلَ لَكُمُ ٱلْأَرْضَ فِرَٰشًۭا وَٱلسَّمَآءَ بِنَآءًۭ
//   وَأَنزَلَ مِنَ ٱلسَّمَآءِ مَآءًۭ فَأَخْرَجَ بِهِۦ مِنَ ٱلثَّمَرَٰتِ
//   رِزْقًۭا لَّكُمْ ۖ فَلَا تَجْعَلُوا۟ لِلَّهِ أَندَادًۭا وَأَنتُمْ
//   تَعْلَمُونَ ٢٢
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   وَإِن كُنتُمْ فِى رَيْبٍۢ مِّمَّا نَزَّلْنَا عَلَىٰ عَبْدِنَا
//   فَأْتُوا۟ بِسُورَةٍۢ مِّن مِّثْلِهِۦ وَٱدْعُوا۟ شُهَدَآءَكُم مِّن
//   دُونِ ٱللَّهِ إِن كُنتُمْ صَـٰدِقِينَ ٢٣
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   فَإِن لَّمْ تَفْعَلُوا۟ وَلَن تَفْعَلُوا۟ فَٱتَّقُوا۟ ٱلنَّارَ ٱلَّتِى
//   وَقُودُهَا ٱلنَّاسُ وَٱلْحِجَارَةُ ۖ أُعِدَّتْ لِلْكَـٰفِرِينَ ٢٤
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//   وَبَشِّرِ ٱلَّذِينَ ءَامَنُوا۟ وَعَمِلُوا۟ ٱلصَّـٰلِحَـٰتِ أَنَّ
//   لَهُمْ جَنَّـٰتٍۢ تَجْرِى مِن تَحْتِهَا ٱلْأَنْهَـٰرُ ۖ كُلَّمَا
//   رُزِقُوا۟ مِنْهَا مِن ثَمَرَةٍۢ رِّزْقًۭا ۙ قَالُوا۟ هَـٰذَا ٱلَّذِى
//   رُزِقْنَا مِن قَبْلُ ۖ وَأُتُوا۟ بِهِۦ مُتَشَـٰبِهًۭا ۖ وَلَهُمْ
//   فِيهَآ أَزْوَٰجٌۭ مُّطَهَّرَةٌۭ ۖ وَهُمْ فِيهَا خَـٰلِدُونَ ٢٥
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
//  إِنَّ ٱللَّهَ لَا يَسْتَحْىِۦٓ أَن يَضْرِبَ مَثَلًۭا مَّا بَعُوضَةًۭ فَمَا فَوْقَهَا ۚ فَأَمَّا ٱلَّذِينَ ءَامَنُوا۟ فَيَعْلَمُونَ أَنَّهُ ٱلْحَقُّ مِن رَّبِّهِمْ ۖ وَأَمَّا ٱلَّذِينَ كَفَرُوا۟ فَيَقُولُونَ مَاذَآ أَرَادَ ٱللَّهُ بِهَـٰذَا مَثَلًۭا ۘ يُضِلُّ بِهِۦ كَثِيرًۭا وَيَهْدِى بِهِۦ كَثِيرًۭا ۚ وَمَا يُضِلُّ بِهِۦٓ إِلَّا ٱلْفَـٰسِقِينَ ٢٦        
//  </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
// ٱلَّذِينَ يَنقُضُونَ عَهْدَ ٱللَّهِ مِنۢ بَعْدِ مِيثَـٰقِهِۦ وَيَقْطَعُونَ مَآ أَمَرَ ٱللَّهُ بِهِۦٓ أَن يُوصَلَ وَيُفْسِدُونَ فِى ٱلْأَرْضِ ۚ أُو۟لَـٰٓئِكَ هُمُ ٱلْخَـٰسِرُونَ ٢٧         
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
// كَيْفَ تَكْفُرُونَ بِٱللَّهِ وَكُنتُمْ أَمْوَٰتًۭا فَأَحْيَـٰكُمْ ۖ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ثُمَّ إِلَيْهِ تُرْجَعُونَ ٢٨        
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
// هُوَ ٱلَّذِى خَلَقَ لَكُم مَّا فِى ٱلْأَرْضِ جَمِيعًۭا ثُمَّ ٱسْتَوَىٰٓ إِلَى ٱلسَّمَآءِ فَسَوَّىٰهُنَّ سَبْعَ سَمَـٰوَٰتٍۢ ۚ وَهُوَ بِكُلِّ شَىْءٍ عَلِيمٌۭ ٢٩        
// </p>
// <div className="border-b-2 border-gray-600 border-dashed"></div>
// <p className=" pr-8 ">
// وَإِذْ قَالَ رَبُّكَ لِلْمَلَـٰٓئِكَةِ إِنِّى جَاعِلٌۭ فِى ٱلْأَرْضِ خَلِيفَةًۭ ۖ قَالُوٓا۟ أَتَجْعَلُ فِيهَا مَن يُفْسِدُ فِيهَا وَيَسْفِكُ ٱلدِّمَآءَ وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ ۖ قَالَ إِنِّىٓ أَعْلَمُ مَا لَا تَعْلَمُونَ ٣٠        </p>